<?php include("path.php"); ?>
<!doctype html>
<html lang="en">

<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>SavKon CRM</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-T3c6CoIi6uLrA9TneNEoa7RxnatzjcDSCmG1MXxSR1GAsXEV/Dwwykc2MPK8M2HN" crossorigin="anonymous">
</head>

<body>
    <?php include("app/include/header.php"); ?>
    <!-- блок main START -->
    <div class="container">
        <div class="content row">
            <div class="main-content col-12 col-md-9">
                <h2>
                    «Только не „Битрикс“!». 
                    Почему не стоит игнорировать изучение 
                    этого фреймворка
                </h2>                
                <div class="single_post row">
                    <div class="img col-12">
                        <img src="assets/images/bitrix.jpg" alt="" class="img-thumbnail">
                    </div>
                    <div class="info">
                        <i class="fa fa-user">Имя автора</i>
                        <i class="fa fa-calendar">Mar 11, 2019</i>
                    </div>
                    <h3>
                        За что программисты не любят «Битрикс»
                    </h3>
                    <div class="single_post_text col-12">
                        Программисты <a href="https://ru.wikipedia.org/wiki/PHP">PHP</a> не хотят связываться с «Битриксом» — считают его неинтересным, слишком сложным, тяжелым, неизящным и переоцененным. Гораздо проще найти разработчика Laravel, Symfony или Yii2.
                        На мой взгляд, пренебрежение к «Битриксу» у программистов PHP появилось по трем причинам.
                        Плохо представлена документация. Во фреймворке много функционала, который не описан, и, чтобы понять, как он работает, надо лезть в код.
                        Быть только программистом недостаточно. Коробка содержит много механизмов, которые необходимо знать не только в качестве программиста, но и в качестве аналитика-консультанта.
                        Например, в «Битрикс24» запросы клиентов часто решаются не программированием, а обычной настройкой. Допустим, клиент хочет, чтобы после завершения задачи стартовал еще один бизнес-процесс. Тут не надо писать код — нужно лезть в настройки. Это, скорее, задача для консультанта, а не для программиста. Но консультантов «Битрикс» сейчас еще меньше, чем разработчиков, поэтому с этими вопросами заказчики идут к программистам, которые не знают, что ответить.
                        Обе проблемы временные и связаны с тем, что «Битрикс» только развивается и рынок еще не устоялся. Постепенно документацию исправят и произойдет четкое разделение на консультантов и программистов.
                        «Битрикс» в основном известен как CMS. Большинство разработчиков знают «Битрикс» как CMS для создания сайтов-визиток. 80% программистов использовали только базовые функции и никогда не погружались внутрь, не пытались изучать систему и ядро фреймворка: ORM, Highload-блоки, мастера, визарды. Пощупали «Битрикс» снаружи — не понравилось, а развернуть не попытались. Это как попробовать съесть мандарин в кожуре.
                        Те, кому, как мне, посчастливилось поработать на серьезных проектах, где на базе «Битрикса» разрабатывают собственный функционал, говорят, что «Битрикс» — полноценный фреймворк. У него есть недочеты, но он позволяет полностью вести разработку.
                        Становление «Битрикса» похоже на становление 1С
                        То, что происходит сейчас с «Битриксом», напоминает мне становление 1С. Когда 1С только появился, среди программистов существовало мнение, что это не язык программирования, а ерунда. Над специалистами, которые осваивали 1С, смеялись. Им говорили, что писать на русском — «фи» и что скоро фирма «1С» загнется.
                        Но этого не произошло. У компании настолько сильный маркетинговый штат, что «1С» завоевала рынок. Сначала она заинтересовала предприятия малого и среднего бизнеса, а программные продукты на базе восьмого ядра привели фирме «1С» крупных клиентов. Сейчас «1С: Предприятие» используют 1 500 000 организаций.
                        Разработчики, которые стояли на том, что программировать на 1С низко и неинтересно, оказались не правы. Нельзя сказать, что они остались не у дел. Они все равно востребованы, но намного меньше. Большинство специалистов все-таки пришло к тому, что надо перепрофилироваться на 1С.
                        То же самое происходит с «Битриксом». С каждым годом «Битрикс» все популярнее у клиентов, но большинство программистов PHP не хочет с ним работать, хотя это перспективное и высокооплачиваемое направление.
                        Перспективы «Битрикса»
                        Битрикс-разработчики, которые занимаются программированием больших порталов и сложных личных кабинетов, очень востребованы и высокооплачиваемы. В зависимости от региона они зарабатывают от 30 000 (джуниоры) до 200 000 ₽ (сеньоры). Конечно, когда появится больше программистов и ниша заполнится, общий уровень заработка немного упадет. Но специалисты в этой сфере, скорее всего, будут востребованы всегда.
                        Специалисты, которые работают с Laravel, Symfony или любым другим MVC фреймворком PHP, останутся востребованными. У этих решений большая доля рынка, но достаточно специфические задачи.
                        Я считаю, через несколько лет «Битрикс» заберет 80–90% рынка, потому что он в первую очередь ориентирован на бизнес. Если посмотреть красочные фото или видео конференций, посвященных «Битриксу», становится ясно, как на них реагируют владельцы предприятий.
                    </div>
                </div>
            </div>
            <div class="sidebar col-12 col-md-3">

                <div class="section search">
                    <h3>Поиск</h3>
                    <form action="#" method="post">
                        <input type="text" name="search-term" class="text-input" placeholder="найти...">
                    </form>
                </div>

                <div class="sction topics">
                    <h3>Категории</h3>
                    <ul>
                        <li><a href="#">Программирование</a></li>
                        <li><a href="#">QA</a></li>
                        <li><a href="#">Кейсы</a></li>
                        <li><a href="#">Дизайн</a></li>
                        <li><a href="#">Мотивация</a></li>
                        <li><a href="#">KPI</a></li>
                        <li><a href="#">DevOps</a></li>
                    </ul>
                </div>
                
            </div>
        </div>
    </div> 
    <!-- блок main END -->

    <!-- footer START -->
    <?php include("app/include/footer.php"); ?>
    <!-- footer END -->


    <!-- Font Awesome -->
    <script src="https://kit.fontawesome.com/02bbf82270.js" crossorigin="anonymous"></script>
    <!-- Bootstrap 5 -->
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/js/bootstrap.bundle.min.js"
        integrity="sha384-C6RzsynM9kWDrMNeT87bh95OGNyZPhcTNXj1NW7RuBCsyN/o0jlpcV8Qyq46cDfL"
        crossorigin="anonymous"></script>
    <!-- Custom Styling -->
    <link rel="stylesheet" href="assets/css/style.css">
    <link rel="preconnect" href="https://fonts.gstatic.com">
    <link href="https://fonts.googleapis.com/css2?family=Comfortaa:wght@300;400;500;600;700&display=swap"
        rel="stylesheet">

    <!-- Option2 
    <script src="https://cdn.jsdelivr.net/npm/@popperjs/core@2.11.8/dist/umd/popper.min.js" integrity="sha384-I7E8VVD/ismYTF4hNIPjVp/Zjvgyol6VFvRkX/vR+Vc4jQkC+hVqc2pM8ODewa9r" crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/js/bootstrap.min.js" integrity="sha384-BBtl+eGJRgqQAUMxJ7pMwbEyER4l1g+O15P+16Ep7Q9Q+zqX6gSbd85u4mG4QzX+" crossorigin="anonymous"></script> -->
</body>

</html>